import "./Advantages.scss"

const advantages = [
    {title: "Опыт", ours: "Мы работаем уже 30 лет и накопили уникальный опыт. Любые трудности для нас это пустяк", others: "Для компаний с маленьким опытом работы любая сложность может стать причиной технических ошибок, срыва сроков и непредвиденных расходов"},
    {title: "Качество", ours: "Мы проводим весь необходимый комплекс работ для каждого объекта. Это гарантирует 100% прохождение экспертизы", others: "Наши конкуренты, гонясь за низкой ценой и высокой прибылью, зачастую недобросовестно подходят к работе. Они забывают, что ИИ – одно из самых ответственных стадий проектирования"},
    {title: "Оперативность", ours: "Мы даем быстрый ответ на ваше обращение. Обычно в течение часа", others: "Заявка обрабатывается два-три дня"},
    {title: "Кадры", ours: "В нашей профессиональной команде 13 высококвалифицированных специалистов. Из них 3 кандидата, 1 доктор наук, 2 эксперта", others: "Другие компании экономят на качественных кадрах. Неточные данные изысканий могут привести к некорректным проектным решениям"},
    {title: "Сроки", ours: "Мы обладаем огромным опытом и собственной уникальной базой пройденных скважин. Это позволяет нам предвидеть проблемы и работать значительно быстрее конкурентов, и никогда не нарушать условия договора", others: "Большинство других компаний не укладываются в сроки"},
]

export default function Advantages(){
    return(
        <section className="advantages">
            <div className="advantages__container">
                <div className="advantages__header">
                    <p className="advantages__caption">Чем мы отличаемся?</p>
                    <h2>НАШИ ПРЕИМУЩЕСТВА</h2>
                </div>
                <div className="advantages__list">
                    {advantages.map((advantage) => (
                        <div key={advantage.title} className="advantages__item">
                            <h2>{advantage.title}</h2>
                            <div className="advantages__comparison">
                                <div className="advantages__ours">
                                    <h3>Как это делаем мы</h3>
                                    <p>{advantage.ours}</p>
                                </div>
                                <div className="advantages__others">
                                    <h3>Как это делают другие</h3>
                                    <p>{advantage.others}</p>
                                </div>
                            </div>
                        </div>
                    ))}
                </div>
            </div>
        </section>
    )
}
